{
    "version": "https://jsonfeed.org/version/1",
    "title": "apolzek",
    "home_page_url": "https://apolzek.github.io/",
    "feed_url": "https://apolzek.github.io/feed.json",
    "description": null,
    "icon": "https://apolzek.github.io/apple-touch-icon.png",
    "favicon": "https://apolzek.github.io/favicon.ico",
    "expired": false,
    
    "author":  {
        "name": "apolzek",
        "url": null,
        "avatar": null
    },
    
"items": [
    
        {
            "id": "https://apolzek.github.io/2026/01/12/hello-world",
            "title": "Hello World =)",
            "summary": null,
            "content_text": "saving you some time: just a quick intro and what I’m trying to do hereABOUT  This blog is a personal side project where I dump thoughts about reliability engineering, observability, programming, and adjacent rabbit holes;  English isn’t my first language. I’m writing in English on purpose to practice and get better, so yeah, there may be rough edges;  I’m a reliability engineer/platform engineer with professional experience in Brazil. Everything written here reflects my own opinions, not my employer’s or anyone else’s;  Mostly, I write for myself.GOALS  Talk about tools that fly under the radar but are genuinely interesting;  Keep track of my studies through short, reflective posts;  Share opinions and experiences around open-source projects;  Revisit old notes in the future and see how my thinking has evolved;  Share the results of POCs and labs with friends and colleagues.Welcome aboard!!",
            "content_html": "<p><strong>saving you some time</strong>: <em>just a quick intro and what I’m trying to do here</em></p><h2 id=\"about\">ABOUT</h2><ul>  <li>This blog is a personal side project where I dump thoughts about reliability engineering, observability, programming, and adjacent rabbit holes;</li>  <li>English isn’t my first language. I’m writing in English on purpose to practice and get better, so yeah, there may be rough edges;</li>  <li>I’m a reliability engineer/platform engineer with professional experience in Brazil. Everything written here reflects my own opinions, not my employer’s or anyone else’s;</li>  <li>Mostly, I write for myself.</li></ul><h2 id=\"goals\">GOALS</h2><ul>  <li>Talk about tools that fly under the radar but are genuinely interesting;</li>  <li>Keep track of my studies through short, reflective posts;</li>  <li>Share opinions and experiences around open-source projects;</li>  <li>Revisit old notes in the future and see how my thinking has evolved;</li>  <li>Share the results of POCs and labs with friends and colleagues.</li></ul><p><strong>Welcome aboard!!</strong></p><p><img src=\"/assets/gif/study.webp\" alt=\"study\" /></p>",
            "url": "https://apolzek.github.io/2026/01/12/hello-world",
            
            
            
            
            
            "date_published": "2026-01-12T00:00:00+00:00",
            "date_modified": "2026-01-12T00:00:00+00:00",
            
                "author":  {
                "name": "apolzek",
                "url": null,
                "avatar": null
                }
                
            
        }
    
    ]
}