{
    "version": "https://jsonfeed.org/version/1",
    "title": "apolzek",
    "home_page_url": "/",
    "feed_url": "/feed.json",
    "description": "blog",
    "icon": "/apple-touch-icon.png",
    "favicon": "/favicon.ico",
    "expired": false,
    
"items": [
    
        {
            "id": "/2024/08/11/tips-and-tricks.html",
            "title": "tips-and-tricks",
            "summary": "Tips And Tricks",
            "content_text": "",
            "content_html": "",
            "url": "/2024/08/11/tips-and-tricks.html",
            
            
            
            "tags": ["tips","linux"],
            
            "date_published": "2024-08-11T00:00:00+00:00",
            "date_modified": "2024-08-11T00:00:00+00:00",
            
                "author": 
                ""
                
            
        },
    
        {
            "id": "/2024/07/11/dicionario-tech.html",
            "title": "dicionario-tech",
            "summary": "Dicionário Tech",
            "content_text": "KISSDRYCQRSJWTBasic, Digestor ser complexo, pode ser abordado de diferentes formas dentro das empre, Cookie, Session, Token, JWT, API key",
            "content_html": "<p>KISSDRYCQRSJWT</p><p>Basic, Digestor ser complexo, pode ser abordado de diferentes formas dentro das empre, Cookie, Session, Token, JWT, API key</p>",
            "url": "/2024/07/11/dicionario-tech.html",
            
            
            
            "tags": ["tech","words"],
            
            "date_published": "2024-07-11T00:00:00+00:00",
            "date_modified": "2024-07-11T00:00:00+00:00",
            
                "author": 
                ""
                
            
        },
    
        {
            "id": "/2024/06/11/sistemas-observaveis.html",
            "title": "sistemas-observaveis",
            "summary": "Sistemas Observáveis",
            "content_text": "Antes de iniciar, responda as seguintes questões mentalmente:1) Para obter observabilidade, é necessário ter monitoramento previamente?2) Os dados relacionados ao negócio também fazem parte da observabilidade?3) Qual é o investimento apropriado para assegurar a observabilidade de um sistema ou produto?4) Quais questões podem ser respondidas ao se atingir o estágio de observabilidade em um sistema?5) Como saber quando a observabilidade foi alcançada?Quando falamos de “observabilidade”, é comum logo pensarmos em uma série de ferramentas e dashboards atraentes. Associamos também esse conceito aos seus pilares, que são: logs, traces e métricas. Mas o que isso realmente significa? Na minha concepção, observabilidade é a capacidade de compreender o funcionamento de um sistema em um determinado momento, sem a necessidade de grandes esforços mentais. Isso requer uma visão abrangente e profunda não apenas dos componentes principais, mas também de suas dependências. Nos últimos anos, temos visto um crescimento exponencial em tamanho e complexidade dos sistemas, o que tem impulsionado a indústria a desenvolver ferramentas avançadas para esse contexto. O que você lerá a seguir é a opinião de alguém que já enfrentou os desafios de suportar produtos críticos operando 24/7, utilizando as mais diversas soluções de observabilidade.Inicialmente tenha em mente que o conceito de observabilidade vai além de ter boas métricas e ferramentas configuradas. Envolve ajudar o observador a entender o que o sistema deveria fazer e se ele de fato está fazendo isso. Por ser complexo, pode ser abordado de diferentes formas dentro das empresas. O mais comum é trabalhar por níveis, onde o topo da pirâmide se concentra em ver um panorama geral com informações mais ligadas ao negócio. À medida que se desce na pirâmide, tem-se mais dados técnicos e a visão tende a ser mais granular. Esse tipo de abordagem ajuda a manter diferentes times focados em analisar aquilo que é de seu domínio técnico (aplicação, rede, banco de dados, etc.).Essa é uma das maneiras de escalar times no ambiente organizacional com varias pessoas e várias frentes. Naturalmente, você terá diferentes níveis de entendimento. Um dos maiores desafios aqui é fornecer uma plataforma uniforme que atenda aos mais variados times de Engenharia.Novamente, se proponha a responder o seguinte questionamento: Por que alguém decidiu investir tanto para ter visibilidade de um sistema? A primeira resposta que me vem à mente é: porque esse sistema é importante. E aqui não me entenda mal, o sistema pode ser importante tanto por sua capacidade de gerar receita quanto por seu valor ideológico; isso não importa. O que importa é que todos nós estamos empenhados em garantir uma boa experiência para o usuário final. Em determinados momentos, isso pode ser mais valioso do que o próprio dinheiro. Assim, investimos recursos porque sabemos que os erros inevitavelmente ocorrerão e queremos estar preparados de diversas formas para minimizá-los ou corrigi-los rapidamente.Como usuários finais, somos extremamente exigentes quando se trata de um sistema. Queremos que ele cumpra sua proposta de maneira eficiente.Sistemas computacionais tendem a ser complexos por natureza, pois são construídos sobre uma pilha de abstrações que presumimos estar funcionando corretamente. Se você é um programador, engenheiro de software ou algo do tipo, sabe das variadas formas que existem de construir a mesma funcionalidade. Além disso, há as dependências, como sistemas de banco de dados, sistemas de mensageria, caches e outros. Temos também a parte de comunicação, que pode envolver redes de computadores usando diferentes protocolos(pilhas). Para acompanhar a evolução, essas ferramentas também foram naturalmente melhoradas, e algumas até substituídas. Nosso objetivo é ver todas essas partes em detalhes. Isso permite que saiamos do campo da especulação e entremos no do determinismo. Aqui, o futuro é considerado fixo e definido com base no estado atual e nas leis naturais que governam o universo.Na prática significa que se o throughput de uma API está aumentando, mais chamadas laterais podem acontecer, resultando em um alto consumo de banda e maior uso do banco de dados. Nesse sentido, é importante lembrar que se o sistema foi mal desenhado ou se seus subsistemas carregam débitos técnicos a observabilidade vai te ajudar a identificar esses problemas rapidamente.Quem avisa amigo é. Cuidado para não tratar apenas um problema que é reflexo de um problema maior. O efeito cascata é comum em arquiteturas complexas e encontrar a causa raiz costuma  ser difícil! Vamos seguido..Normalmente o que consguimos ter dos sistemas são logs, traces, métricas e eventos. Existem várias ferramentas no mercado para lidar com isso tais como: Prometheus, Grafana, Elasticsearch, Logstash, Kibana, Splunk, New Relic, Datadog, Jaeger, Zipkin, Dynatrace, Honeycomb, AppDynamics, Sentry, Fluentd, Nagios, Zabbix, VictoriaMetrics, Thanos, OpenTelemetry e Graylog. Essa lista é apenas uma pequena amostra, pois há muitas outras ferramentas disponíveis. Quero destacar três das ferramentas supracitadas e fazer uma breve tangente: Dynatrace, New Relic e Datadog. Em todos os lugares em que trabalhei, pelo menos uma dessas três empresas estava presente. O mais intrigante é que todas elas enfrentaram o mesmo problema: custo em ascensão acelerado(custo por mês). Contudo, meu objetivo aqui não é critica-las nem mesmo suas soluções de mercado, mas, em aprender com os seus modelos de negócios e no que eles implicam.Essas empresas normalmente enfrentam três desafios principais. O primeiro está relacionado à própria observabilidade, ou seja, como extrair dados relevantes de sistemas complexos da forma mais abstrata possível para seus clientes. O segundo é como fornecer visualizações rápidas, elegantes e confiáveis, lembrando que cada cliente terá necessidades específicas. O terceiro desafio está relacionado ao modelo de negócio mencionado anteriormente e diz respeito a como essas empresas lidam com a grande quantidade de dados extraídos. A verdade é que crescer é natural e, se você não tiver um bom planejamento, vai precisar de uma boa quantia de dinheiro. Seja porque sua volumetria aumentou, novos sistemas surgiram ou sua configuração de verbosidade não está das melhores. No final, esteja preparado para pagar o preço. Dentre as perguntas que você se propôs a responder até agora, aqui entra a primeira diretamente relacionada a uma grande decisão de um projeto de observabilidade: pagar mais caro e delegar ou tentar economizar abraçando a complexidade técnica? Eu não posso responder essa pergunta e você sabe muito bem disso.Saindo do assunto dinheiro, um movimento que tenho percebido nos últimos anos é a de atentar a observabilidade no inicio dos projetos, assim como aconteceu com a segurança, depois de mais de um século de batalha, ataques hackers, perdas financeiras e muita conscientização. As pessoas sabem que precisam ter visibilidade de seus sistemas(bem como eles precisam estar seguros) e hoje grandes projetos de software (open source ou não) possuem bons logs e pelo menos um /metrics. Estamos caminhando para tratar o assunto logo no inicio dos projetos.Agora, se você participa de um projeto e produto e está querendo deixá-lo observável, aí vai uma dica, sempre utilize as perguntas. Comece questionando o que você quer responder? Estou transacionando? Minhas aplicações estão saudáveis? Meus tempos de resposta são satisfatórios? E por ai vai. Seu percurso será uma montanha-russa de sucessos e fracassos, porque no final nenhuma ferramenta tem a capacidade de superar sua visão de um sistema computacional. Chegou a hora de pensar!Para responder tudo o que você precisa, será necessário pensar em quais tecnologias usar, como lidar com o crescimento de dados, quais tipos de métricas são importantes, como lidar com uma possível mudança na stack, como manter essas tecnologias atualizadas, qual volume esperado, qual o orçamento disponível, quais dados devem estar presentes nos dashboards e como escalar o projeto para diferentes times.Vamos refletir. Talvez a parte CORE do seu sistema esteja funcionando normalmente, mas seu serviço de autenticação esteja fora do ar. Seu usuário não consegue fazer login e isso basta: você está perdendo a cada minuto uma cota de SLA. Nesse caso, espero que algum alarme seja disparado. Caso contrário, você vai depender da boa vontade de algum engenheiro de confiabilidade abrir o dashboard, ou até antes disso, de uma onda de reclamações no seu canal de atendimento.O cenário hipotético acima ressalta a importância fundamental de um engenheiro competente. As mentes hábeis selecionarão as ferramentas adequadas, que se assemelham a uma terra fértil para o plantio. Estas auxiliarão na geração, captura e armazenamento de dados sobre os sistemas. Posteriormente, o mesmo engenheiro hábil os correlacionará de modo a representarem aspectos significativos do negócio. A agregação desses dados, apresentada de forma simplificada, proporciona uma visão compreensível mesmo para aqueles que não compartilham da mesma visão holística. Em síntese, alguém pensará de antemão para que os subsequentes não precisem fazê-lo. Trata-se de um projeto de melhoria contínua que jamais se encerra. O reflexo disso é ter dados bons o suficiente para montar alarmes eficazes que vão ajudar a responder a incidentes de maneira rápida. Repita esse fluxo várias vezes, pois observabilidade está mais para um processo contínuo do que um estado final.Definir padrões, fazer previsões de armazenamento, selecionar e manter ferramentas, estabelecer métricas relevantes, configurar rastreamento distribuído, compreender as dependências do sistema, lidar com sistemas assíncronos e diferentes tecnologias são apenas alguns dos desafios complexos enfrentados.Chegou o momento de eu opinar dando as minhas respostas às perguntas iniciais1) Como saber quando a observabilidade foi alcançada?Quando estou apto a responder todas as perguntas que me propus a responder.2) Para obter observabilidade, é necessário ter monitoramento previamente?Monitoramento é um estágio de transição para a observabilidade. Está mais relacionado à maturidade, onde o monitoramento leva à observabilidade.3) Qual é o investimento apropriado para assegurar a observabilidade de um sistema ou produto?É relativo e varia de acordo com o tipo de produto, receita esperada, nível de criticidade, SLA, e também o tamanho e a complexidade.4) Quais questões podem ser respondidas ao se atingir o estágio de observabilidade em um sistema?Meu sistema está fazendo o que deveria?5) Os dados relacionados ao negócio também fazem parte da observabilidade?Se ajudam a entender o sistema, fazem parte da observabilidade. Podem ser apresentados separadamente, mas implicam em como o sistema está operando.",
            "content_html": "<p>Antes de iniciar, responda as seguintes questões mentalmente:</p><p><strong>1) Para obter observabilidade, é necessário ter monitoramento previamente?</strong></p><p><strong>2) Os dados relacionados ao negócio também fazem parte da observabilidade?</strong></p><p><strong>3) Qual é o investimento apropriado para assegurar a observabilidade de um sistema ou produto?</strong></p><p><strong>4) Quais questões podem ser respondidas ao se atingir o estágio de observabilidade em um sistema?</strong></p><p><strong>5) Como saber quando a observabilidade foi alcançada?</strong></p><p>Quando falamos de “observabilidade”, é comum logo pensarmos em uma série de ferramentas e dashboards atraentes. Associamos também esse conceito aos seus pilares, que são: logs, traces e métricas. Mas o que isso realmente significa? Na minha concepção, observabilidade é a capacidade de compreender o funcionamento de um sistema em um determinado momento, sem a necessidade de grandes esforços mentais. Isso requer uma visão abrangente e profunda não apenas dos componentes principais, mas também de suas dependências. Nos últimos anos, temos visto um crescimento exponencial em tamanho e complexidade dos sistemas, o que tem impulsionado a indústria a desenvolver ferramentas avançadas para esse contexto. O que você lerá a seguir é a opinião de alguém que já enfrentou os desafios de suportar produtos críticos operando 24/7, utilizando as mais diversas soluções de observabilidade.</p><p>Inicialmente tenha em mente que o conceito de observabilidade vai além de ter boas métricas e ferramentas configuradas. Envolve ajudar o observador a entender o que o sistema deveria fazer e se ele de fato está fazendo isso. Por ser complexo, pode ser abordado de diferentes formas dentro das empresas. O mais comum é trabalhar por níveis, onde o topo da pirâmide se concentra em ver um panorama geral com informações mais ligadas ao negócio. À medida que se desce na pirâmide, tem-se mais dados técnicos e a visão tende a ser mais granular. Esse tipo de abordagem ajuda a manter diferentes times focados em analisar aquilo que é de seu domínio técnico (aplicação, rede, banco de dados, etc.).Essa é uma das maneiras de escalar times no ambiente organizacional com varias pessoas e várias frentes. Naturalmente, você terá diferentes níveis de entendimento. Um dos maiores desafios aqui é fornecer uma plataforma uniforme que atenda aos mais variados times de Engenharia.</p><p>Novamente, se proponha a responder o seguinte questionamento: Por que alguém decidiu investir tanto para ter visibilidade de um sistema? A primeira resposta que me vem à mente é: porque esse sistema é importante. E aqui não me entenda mal, o sistema pode ser importante tanto por sua capacidade de gerar receita quanto por seu valor ideológico; isso não importa. O que importa é que todos nós estamos empenhados em garantir uma boa experiência para o usuário final. Em determinados momentos, isso pode ser mais valioso do que o próprio dinheiro. Assim, investimos recursos porque sabemos que os erros inevitavelmente ocorrerão e queremos estar preparados de diversas formas para minimizá-los ou corrigi-los rapidamente.Como usuários finais, somos extremamente exigentes quando se trata de um sistema. Queremos que ele cumpra sua proposta de maneira eficiente.</p><p>Sistemas computacionais tendem a ser complexos por natureza, pois são construídos sobre uma pilha de abstrações que presumimos estar funcionando corretamente. Se você é um programador, engenheiro de software ou algo do tipo, sabe das variadas formas que existem de construir a mesma funcionalidade. Além disso, há as dependências, como sistemas de banco de dados, sistemas de mensageria, caches e outros. Temos também a parte de comunicação, que pode envolver redes de computadores usando diferentes protocolos(pilhas). Para acompanhar a evolução, essas ferramentas também foram naturalmente melhoradas, e algumas até substituídas. Nosso objetivo é ver todas essas partes em detalhes. Isso permite que saiamos do campo da especulação e entremos no do determinismo. Aqui, o futuro é considerado fixo e definido com base no estado atual e nas leis naturais que governam o universo.Na prática significa que se o throughput de uma API está aumentando, mais chamadas laterais podem acontecer, resultando em um alto consumo de banda e maior uso do banco de dados. Nesse sentido, é importante lembrar que se o sistema foi mal desenhado ou se seus subsistemas carregam débitos técnicos a observabilidade vai te ajudar a identificar esses problemas rapidamente.</p><p>Quem avisa amigo é. Cuidado para não tratar apenas um problema que é reflexo de um problema maior. O efeito cascata é comum em arquiteturas complexas e encontrar a causa raiz costuma  ser difícil! Vamos seguido..</p><p>Normalmente o que consguimos ter dos sistemas são logs, traces, métricas e eventos. Existem várias ferramentas no mercado para lidar com isso tais como: Prometheus, Grafana, Elasticsearch, Logstash, Kibana, Splunk, New Relic, Datadog, Jaeger, Zipkin, Dynatrace, Honeycomb, AppDynamics, Sentry, Fluentd, Nagios, Zabbix, VictoriaMetrics, Thanos, OpenTelemetry e Graylog. Essa lista é apenas uma pequena amostra, pois há muitas outras ferramentas disponíveis. Quero destacar três das ferramentas supracitadas e fazer uma breve tangente: <strong>Dynatrace, New Relic e Datadog</strong>. Em todos os lugares em que trabalhei, pelo menos uma dessas três empresas estava presente. O mais intrigante é que todas elas enfrentaram o mesmo problema: <strong>custo em ascensão acelerado(custo por mês)</strong>. Contudo, meu objetivo aqui não é critica-las nem mesmo suas soluções de mercado, mas, em aprender com os seus modelos de negócios e no que eles implicam.</p><p>Essas empresas normalmente enfrentam três desafios principais. O primeiro está relacionado à própria observabilidade, ou seja, como extrair dados relevantes de sistemas complexos da forma mais abstrata possível para seus clientes. O segundo é como fornecer visualizações rápidas, elegantes e confiáveis, lembrando que cada cliente terá necessidades específicas. O terceiro desafio está relacionado ao modelo de negócio mencionado anteriormente e diz respeito a como essas empresas lidam com a <strong>grande quantidade de dados</strong> extraídos. A verdade é que crescer é natural e, se você não tiver um bom planejamento, vai precisar de uma boa quantia de dinheiro. Seja porque sua volumetria aumentou, novos sistemas surgiram ou sua configuração de verbosidade não está das melhores. No final, esteja preparado para pagar o preço. Dentre as perguntas que você se propôs a responder até agora, aqui entra a primeira diretamente relacionada a uma grande decisão de um projeto de observabilidade: pagar mais caro e delegar ou tentar economizar abraçando a complexidade técnica? Eu não posso responder essa pergunta e você sabe muito bem disso.</p><p>Saindo do assunto <em>dinheiro</em>, um movimento que tenho percebido nos últimos anos é a de atentar a observabilidade no inicio dos projetos, assim como aconteceu com a segurança, depois de mais de um século de batalha, ataques hackers, perdas financeiras e muita conscientização. As pessoas sabem que precisam ter visibilidade de seus sistemas(bem como eles precisam estar seguros) e hoje grandes projetos de software (open source ou não) possuem bons logs e pelo menos um <em>/metrics</em>. Estamos caminhando para tratar o assunto logo no inicio dos projetos.</p><p>Agora, se você participa de um projeto e produto e está querendo deixá-lo observável, aí vai uma dica, sempre utilize as perguntas. Comece questionando o que você quer responder? Estou transacionando? Minhas aplicações estão saudáveis? Meus tempos de resposta são satisfatórios? E por ai vai. Seu percurso será uma montanha-russa de sucessos e fracassos, porque no final nenhuma ferramenta tem a capacidade de superar sua visão de um sistema computacional. Chegou a hora de pensar!</p><p>Para responder tudo o que você precisa, será necessário pensar em quais tecnologias usar, como lidar com o crescimento de dados, quais tipos de métricas são importantes, como lidar com uma possível mudança na stack, como manter essas tecnologias atualizadas, qual volume esperado, qual o orçamento disponível, quais dados devem estar presentes nos dashboards e como escalar o projeto para diferentes times.</p><p>Vamos refletir. Talvez a parte CORE do seu sistema esteja funcionando normalmente, mas seu serviço de autenticação esteja fora do ar. Seu usuário não consegue fazer login e isso basta: você está perdendo a cada minuto uma cota de SLA. Nesse caso, espero que algum alarme seja disparado. Caso contrário, você vai depender da boa vontade de algum engenheiro de confiabilidade abrir o dashboard, ou até antes disso, de uma onda de reclamações no seu canal de atendimento.</p><p>O cenário hipotético acima ressalta a importância fundamental de um engenheiro competente. As mentes hábeis selecionarão as ferramentas adequadas, que se assemelham a uma terra fértil para o plantio. Estas auxiliarão na geração, captura e armazenamento de dados sobre os sistemas. Posteriormente, o mesmo engenheiro hábil os correlacionará de modo a representarem aspectos significativos do negócio. A agregação desses dados, apresentada de forma simplificada, proporciona uma visão compreensível mesmo para aqueles que não compartilham da mesma visão holística. Em síntese, alguém pensará de antemão para que os subsequentes não precisem fazê-lo. Trata-se de um projeto de melhoria contínua que jamais se encerra. O reflexo disso é ter dados bons o suficiente para montar alarmes eficazes que vão ajudar a responder a incidentes de maneira rápida. Repita esse fluxo várias vezes, pois observabilidade está mais para um processo contínuo do que um estado final.</p><p>Definir padrões, fazer previsões de armazenamento, selecionar e manter ferramentas, estabelecer métricas relevantes, configurar rastreamento distribuído, compreender as dependências do sistema, lidar com sistemas assíncronos e diferentes tecnologias são apenas alguns dos desafios complexos enfrentados.</p><p>Chegou o momento de eu opinar dando as minhas respostas às perguntas iniciais</p><p><strong>1) Como saber quando a observabilidade foi alcançada?</strong>Quando estou apto a responder todas as perguntas que me propus a responder.</p><p><strong>2) Para obter observabilidade, é necessário ter monitoramento previamente?</strong>Monitoramento é um estágio de transição para a observabilidade. Está mais relacionado à maturidade, onde o monitoramento leva à observabilidade.</p><p><strong>3) Qual é o investimento apropriado para assegurar a observabilidade de um sistema ou produto?</strong>É relativo e varia de acordo com o tipo de produto, receita esperada, nível de criticidade, SLA, e também o tamanho e a complexidade.</p><p><strong>4) Quais questões podem ser respondidas ao se atingir o estágio de observabilidade em um sistema?</strong>Meu sistema está fazendo o que deveria?</p><p><strong>5) Os dados relacionados ao negócio também fazem parte da observabilidade?</strong>Se ajudam a entender o sistema, fazem parte da observabilidade. Podem ser apresentados separadamente, mas implicam em como o sistema está operando.</p>",
            "url": "/2024/06/11/sistemas-observaveis.html",
            
            
            
            "tags": ["observabilidade","monitoramento"],
            
            "date_published": "2024-06-11T00:00:00+00:00",
            "date_modified": "2024-06-11T00:00:00+00:00",
            
                "author": 
                ""
                
            
        }
    
    ]
}