{
    "version": "https://jsonfeed.org/version/1",
    "title": "apolzek",
    "home_page_url": "/",
    "feed_url": "/feed.json",
    "description": "blog",
    "icon": "/apple-touch-icon.png",
    "favicon": "/favicon.ico",
    "expired": false,
    
"items": [
    
        {
            "id": "/2024/09/09/meu-alerta-e-eficaz.html",
            "title": "🚨 Meu alerta é eficaz ?",
            "summary": "Uma breve reflexão sobre a criação de alertas que realmente funcionam como deveriam",
            "content_text": "Eu não quero te iludir, talvez você saia daqui com mais dúvidas do que respostas.. faz parteVamos raciocinar.. através de métricas conseguimos ter de maneira quantificada como as coisas estão. Coisas podem um banco de dados, um aplicação, uma rede de computares ou até uma geladeira. Antes de prosseguir é válido reforçar algo, alguns sistemas já possuem métricas nativamente, outros possuem exporters(programas especializados) que conseguem extrair isso pra você. Um terceiro caso é você mesmo criar suas métricas através de instrumentação de código ou técnica similar. O ponto aqui é, para criar bons alarmes você precisa de boas métricas. Sem isso fica inviável seguir. Assim como testes unitários dos software imagine que as métricas tem um coverage, ou seja, elas cobrem uma porcentagem(%) da superfície que você deseja monitorar. Mas até aqui tudo bem, sei que suas métricas são boas e suficientes.Com as métricas em mão, você precisa montar seus alertas e aqui vem o primeiro grande desafio. Se você está usando prometheus terá que lidar com promql, se usa NewRelic terá que lidar com nrql e por ai vai. Não adianta se esconder, encare esse desfio de frente.$__rate_interval2024-07-09 16:11:08app_request_latency_seconds_bucket {__name__=\"app_request_latency_seconds_bucket\", endpoint=\"/\", instance=\"flask-app:5000\", job=\"app_exporter\", le=\"1.0\", method=\"GET\"}1172024-07-09 16:28:08app_request_latency_seconds_bucket {__name__=\"app_request_latency_seconds_bucket\", endpoint=\"/\", instance=\"flask-app:5000\", job=\"app_exporter\", le=\"1.0\", method=\"GET\"}318Vamos fazer 318 - 117 / 1020 = 0,197058824",
            "content_html": "<p>Eu não quero te iludir, talvez você saia daqui com mais dúvidas do que respostas.. faz parte</p><p>Vamos raciocinar.. através de métricas conseguimos ter de maneira quantificada como as coisas estão. Coisas podem um banco de dados, um aplicação, uma rede de computares ou até uma geladeira. Antes de prosseguir é válido reforçar algo, alguns sistemas já possuem métricas nativamente, outros possuem exporters(programas especializados) que conseguem extrair isso pra você. Um terceiro caso é você mesmo criar suas métricas através de instrumentação de código ou técnica similar. O ponto aqui é, para criar bons alarmes você precisa de boas métricas. Sem isso fica inviável seguir. Assim como testes unitários dos software imagine que as métricas tem um coverage, ou seja, elas cobrem uma porcentagem(%) da superfície que você deseja monitorar. Mas até aqui tudo bem, sei que suas métricas são boas e suficientes.</p><p>Com as métricas em mão, você precisa montar seus alertas e aqui vem o primeiro grande desafio. Se você está usando prometheus terá que lidar com promql, se usa NewRelic terá que lidar com nrql e por ai vai. Não adianta se esconder, encare esse desfio de frente.</p><p>$__rate_interval</p><p>2024-07-09 16:11:08</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>app_request_latency_seconds_bucket {__name__=\"app_request_latency_seconds_bucket\", endpoint=\"/\", instance=\"flask-app:5000\", job=\"app_exporter\", le=\"1.0\", method=\"GET\"}117</code></pre></div></div><p>2024-07-09 16:28:08</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>app_request_latency_seconds_bucket {__name__=\"app_request_latency_seconds_bucket\", endpoint=\"/\", instance=\"flask-app:5000\", job=\"app_exporter\", le=\"1.0\", method=\"GET\"}318</code></pre></div></div><p>Vamos fazer 318 - 117 / 1020 = 0,197058824</p>",
            "url": "/2024/09/09/meu-alerta-e-eficaz.html",
            
            
            
            "tags": ["prometheus","alerts"],
            
            "date_published": "2024-09-09T00:00:00+00:00",
            "date_modified": "2024-09-09T00:00:00+00:00",
            
                "author": 
                ""
                
            
        },
    
        {
            "id": "/2024/08/11/sre-tips-and-tricks.html",
            "title": "SRE Tips and Tricks",
            "summary": "Tips And Tricks",
            "content_text": "asdf ou mise https://github.com/connorads/misealiasAlias monitoralias MONITOR_ALL=’xrandr –output HDMI-1 –mode 1920x1080 –primary –left-of eDP-1 –output eDP-1 –auto’alias MONITOR_JUST_HDMI=’xrandr –output HDMI-1 –mode 1920x1080 –primary –output eDP-1 –off’alias MONITOR_JUST_NOTEBOOK=’xrandr –output HDMI-1 –off –output eDP-1 –auto’alias KEYBOARD_LOCAL=’setxkbmap -model thinkpad -layout br -variant abnt2’alias MONITOR_NOTEBOOK_BRILHANTE=’xrandr –output eDP-1 –brightness 1.2’alias clip=’xclip -selection clipboard’alias docker_killall=’docker rm -f $(docker ps -aq)’ferramentas  docker  kind  nix os",
            "content_html": "<p>asdf ou mise https://github.com/connorads/mise</p><hr /><p>alias</p><h1 id=\"alias-monitor\">Alias monitor</h1><p>alias MONITOR_ALL=’xrandr –output HDMI-1 –mode 1920x1080 –primary –left-of eDP-1 –output eDP-1 –auto’alias MONITOR_JUST_HDMI=’xrandr –output HDMI-1 –mode 1920x1080 –primary –output eDP-1 –off’alias MONITOR_JUST_NOTEBOOK=’xrandr –output HDMI-1 –off –output eDP-1 –auto’alias KEYBOARD_LOCAL=’setxkbmap -model thinkpad -layout br -variant abnt2’alias MONITOR_NOTEBOOK_BRILHANTE=’xrandr –output eDP-1 –brightness 1.2’alias clip=’xclip -selection clipboard’alias docker_killall=’docker rm -f $(docker ps -aq)’</p><hr /><p>ferramentas</p><ul>  <li>docker</li>  <li>kind</li>  <li>nix os</li></ul>",
            "url": "/2024/08/11/sre-tips-and-tricks.html",
            
            
            
            "tags": ["tips","linux"],
            
            "date_published": "2024-08-11T00:00:00+00:00",
            "date_modified": "2024-08-11T00:00:00+00:00",
            
                "author": 
                ""
                
            
        },
    
        {
            "id": "/2024/07/12/sistemas-observaveis-parte-1.html",
            "title": "Sistemas Observáveis - Parte 1",
            "summary": "Reflexão sobre Observabilidade em Ecossistemas Complexos",
            "content_text": "Antes de iniciar, responda as seguintes questões mentalmente:1) É necessário ter monitoramento previamente para alcançar a observabilidade?2) Os dados relacionados ao negócio também fazem parte da observabilidade?3) Quais questões podem ser respondidas ao se atingir o estágio de observabilidade em um sistema?Quando falamos de “observabilidade”, é comum logo pensarmos em uma série de ferramentas e dashboards atraentes. Associamos também esse conceito aos seus pilares, que são: logs, traces e métricas. Mas o que isso realmente significa? Na minha concepção, observabilidade é a capacidade de compreender o funcionamento de um sistema em um determinado momento, sem a necessidade de grandes esforços mentais. Isso requer uma visão abrangente e profunda não apenas dos componentes principais, mas também de suas dependências. Nos últimos anos, temos visto um crescimento exponencial em tamanho e complexidade dos sistemas, o que tem impulsionado a indústria a desenvolver ferramentas avançadas para esse contexto. O que você lerá a seguir é a opinião de alguém que já enfrentou os desafios de suportar produtos críticos operando 24/7, utilizando as mais diversas soluções de observabilidade.Inicialmente tenha em mente que o conceito de observabilidade vai além de ter boas métricas e ferramentas configuradas. Envolve ajudar o observador a entender o que o sistema deveria fazer e se ele de fato está fazendo. Por ser complexo, pode ser abordado de diferentes formas dentro das empresas. O mais comum é trabalhar por níveis, onde o topo da pirâmide se concentra em ver um panorama geral com informações mais ligadas ao negócio. À medida que se desce na pirâmide, tem-se mais dados técnicos e a visão tende a se granularizar. Esse tipo de abordagem ajuda a manter diferentes times focados em analisar aquilo que é de seu domínio técnico (aplicação, rede, banco de dados, etc.). Essa é uma das maneiras de escalar times no ambiente organizacional com varias pessoas envolvidas em várias frentes. Um dos maiores desafios aqui é fornecer uma plataforma uniforme que atenda aos mais variados times de Engenharia.Novamente, se proponha a responder mais um questionamento: Por que alguém decidiu investir tanto para ter visibilidade de um sistema? A primeira resposta que me vem à mente é: porque esse sistema é importante. E aqui não me entenda mal, o sistema pode ser importante tanto por sua capacidade de gerar receita quanto por seu valor ideológico; isso não importa. O que importa é que todos nós estamos empenhados em garantir uma boa experiência para o usuário final. Em determinados momentos, isso pode ser mais valioso do que o próprio dinheiro. Assim, investimos recursos porque sabemos que os erros inevitavelmente ocorrerão e queremos estar preparados de diversas formas para minimizá-los ou corrigi-los rapidamente. Como usuários finais, somos extremamente exigentes.Sistemas computacionais tendem a ser complexos por natureza, pois são construídos sobre uma pilha de abstrações que presumimos estar funcionando corretamente. Se você é um programador, engenheiro de software ou algo do tipo, sabe que existe várias formas de se construir a mesma coisa. Além disso, há as dependências, como sistemas de banco de dados, sistemas de mensageria, caches e outros. Temos também a parte de comunicação, que pode envolver redes de computadores usando diferentes protocolos(pilhas). Nosso objetivo então é ter detalhes sobre todas as partes. Isso permite que saiamos do campo da especulação e entremos no do determinismo. Aqui, o futuro é considerado fixo e definido com base no estado atual e nas leis naturais que governam o universo. Na prática significa que se o throughput de uma API está aumentando, mais chamadas laterais podem acontecer, resultando em um alto consumo de banda e maior uso do banco de dados. Nesse sentido, é importante lembrar que se o sistema foi mal desenhado ou se seus subsistemas carregam débitos técnicos a observabilidade vai te ajudar a identificar esses problemas rapidamente.⚠️ Quem avisa amigo é. Cuidado para não tratar apenas um problema que é reflexo de um problema maior. O efeito cascata é comum em arquiteturas complexas e encontrar a causa raiz costuma  ser difícil! Vamos seguido..Normalmente o que consguimos ter dos sistemas são logs, traces, métricas e eventos. Existem várias ferramentas no mercado para lidar com isso tais como: Prometheus, Grafana, Elasticsearch, Logstash, Kibana, Splunk, New Relic, Datadog, Jaeger, Zipkin, Dynatrace, Honeycomb, AppDynamics, Sentry, Fluentd, Nagios, Zabbix, VictoriaMetrics, Thanos, OpenTelemetry e Graylog. Essa lista é apenas uma pequena amostra, pois há muitas outras ferramentas disponíveis. Quero destacar três das ferramentas supracitadas e fazer uma breve tangente: Dynatrace, New Relic e Datadog. Em todos os lugares em que trabalhei, pelo menos uma dessas três empresas estava presente. O mais intrigante é que todas elas enfrentaram o mesmo problema: custo em ascensão acelerado(custo por mês). Contudo, meu objetivo aqui não é critica-las nem mesmo suas soluções de mercado, mas, em aprender com os seus modelos de negócios e no que eles implicam.Essas empresas normalmente enfrentam três desafios principais. O primeiro está relacionado à própria observabilidade, ou seja, como extrair dados relevantes de sistemas complexos da forma mais abstrata possível para seus clientes. O segundo é como fornecer visualizações rápidas, elegantes e confiáveis, lembrando que cada cliente terá necessidades específicas. O terceiro desafio está relacionado ao modelo de negócio mencionado anteriormente e diz respeito a como essas empresas lidam com a grande quantidade de dados extraídos. A verdade é que crescer é um processo natural e, se você não tiver um bom planejamento, vai precisar de uma boa quantia de dinheiro. Seja porque sua volumetria aumentou, novos sistemas surgiram ou sua configuração de verbosidade não está das melhores. No final, esteja preparado para pagar o preço. Dentre as perguntas que você se propôs a responder até agora, aqui entra a primeira diretamente relacionada a uma grande decisão de um projeto de observabilidade: pagar mais caro e delegar ou tentar economizar abraçando a complexidade técnica? Eu não posso responder essa pergunta e você sabe muito bem disso.Saindo do assunto dinheiro, um movimento que tenho percebido nos últimos anos é a atenção à observabilidade logo no início dos projetos, assim como aconteceu com segurança após décadas de perdas financeiras e vazamentos de dados. As pessoas sabem que precisam ter visibilidade de seus sistemas no dia um(bem como eles precisam estar seguros) e hoje grandes projetos de software (open source ou não) normalmente possuem bons logs e boas métricas(/metrics).A pessoa responsável por buscar observabilidade geralmente começa pesquisando as opções disponíveis para a stack utilizada no projeto ou na empresa. Inicialmente, encontra soluções robustas, porém pagas. Em seguida, inevitavelmente descobre soluções maduras de mercado, como Prometheus, Grafana e OpenTelemetry. Normalmente, a escolha é feita rapidamente, mas existem muitas questões importantes que também devem ser respondidas. Se essas questões forem ignoradas, é apenas uma questão de tempo até que surjam problemas.Definir padrões, fazer previsões de armazenamento, selecionar e manter ferramentas, estabelecer métricas relevantes, configurar rastreamento distribuído, compreender as dependências do sistema, lidar com sistemas assíncronos e diferentes tecnologias são apenas a ponta do iceberg dos desafios que estão por vir.Vamos refletir. Talvez a parte core do seu sistema esteja funcionando normalmente, mas o serviço de autenticação esteja fora do ar. Seus usuários não conseguem fazer login. Isso é suficiente para colocar seu SLA em risco a cada minuto de indisponibilidade. Nesse caso, você deve esperar que algum alarme seja disparado. Caso contrário, dependerá da boa vontade de um engenheiro de confiabilidade abrir o dashboard ou, pior ainda, de uma onda de reclamações no seu canal de atendimento.O cenário hipotético acima ressalta a importância fundamental de um engenheiro competente. As mentes hábeis selecionarão as ferramentas adequadas, que se assemelham a uma terra fértil para o plantio. Estas auxiliarão na geração, captura e armazenamento de dados sobre os sistemas. Posteriormente, o mesmo engenheiro hábil os correlacionará de modo a representarem aspectos significativos do negócio. A agregação desses dados, apresentada de forma simplificada, proporciona uma visão compreensível mesmo para aqueles que não compartilham da mesma visão holística. Em síntese, alguém pensará de antemão para que os subsequentes não precisem fazê-lo. Trata-se de um projeto de melhoria contínua que jamais se encerra. O reflexo disso é ter dados bons o suficiente para montar alarmes eficazes que vão ajudar a responder a incidentes de maneira rápida. Repita esse fluxo várias vezes, pois observabilidade está mais para um processo contínuo do que um estado final.",
            "content_html": "<p>Antes de iniciar, responda as seguintes questões mentalmente:</p><p><strong>1) É necessário ter monitoramento previamente para alcançar a observabilidade?</strong></p><p><strong>2) Os dados relacionados ao negócio também fazem parte da observabilidade?</strong></p><p><strong>3) Quais questões podem ser respondidas ao se atingir o estágio de observabilidade em um sistema?</strong></p><p>Quando falamos de “observabilidade”, é comum logo pensarmos em uma série de ferramentas e dashboards atraentes. Associamos também esse conceito aos seus pilares, que são: logs, traces e métricas. Mas o que isso realmente significa? Na minha concepção, observabilidade é a capacidade de compreender o funcionamento de um sistema em um determinado momento, sem a necessidade de grandes esforços mentais. Isso requer uma visão abrangente e profunda não apenas dos componentes principais, mas também de suas dependências. Nos últimos anos, temos visto um crescimento exponencial em tamanho e complexidade dos sistemas, o que tem impulsionado a indústria a desenvolver ferramentas avançadas para esse contexto. O que você lerá a seguir é a opinião de alguém que já enfrentou os desafios de suportar produtos críticos operando 24/7, utilizando as mais diversas soluções de observabilidade.</p><p>Inicialmente tenha em mente que o conceito de observabilidade vai além de ter boas métricas e ferramentas configuradas. Envolve ajudar o observador a entender o que o sistema deveria fazer e se ele de fato está fazendo. Por ser complexo, pode ser abordado de diferentes formas dentro das empresas. O mais comum é trabalhar por níveis, onde o topo da pirâmide se concentra em ver um panorama geral com informações mais ligadas ao negócio. À medida que se desce na pirâmide, tem-se mais dados técnicos e a visão tende a se granularizar. Esse tipo de abordagem ajuda a manter diferentes times focados em analisar aquilo que é de seu domínio técnico (aplicação, rede, banco de dados, etc.). Essa é uma das maneiras de escalar times no ambiente organizacional com varias pessoas envolvidas em várias frentes. Um dos maiores desafios aqui é fornecer uma plataforma uniforme que atenda aos mais variados times de Engenharia.</p><p>Novamente, se proponha a responder mais um questionamento: <strong>Por que alguém decidiu investir tanto para ter visibilidade de um sistema?</strong> A primeira resposta que me vem à mente é: porque esse sistema é importante. E aqui não me entenda mal, o sistema pode ser importante tanto por sua capacidade de gerar receita quanto por seu valor ideológico; isso não importa. O que importa é que todos nós estamos empenhados em garantir uma boa experiência para o usuário final. Em determinados momentos, isso pode ser mais valioso do que o próprio dinheiro. Assim, investimos recursos porque sabemos que os erros inevitavelmente ocorrerão e queremos estar preparados de diversas formas para minimizá-los ou corrigi-los rapidamente. Como usuários finais, somos extremamente exigentes.</p><p>Sistemas computacionais tendem a ser complexos por natureza, pois são construídos sobre uma pilha de abstrações que presumimos estar funcionando corretamente. Se você é um programador, engenheiro de software ou algo do tipo, sabe que existe várias formas de se construir a mesma coisa. Além disso, há as dependências, como sistemas de banco de dados, sistemas de mensageria, caches e outros. Temos também a parte de comunicação, que pode envolver redes de computadores usando diferentes protocolos(pilhas). Nosso objetivo então é ter detalhes sobre todas as partes. Isso permite que saiamos do campo da especulação e entremos no do determinismo. Aqui, o futuro é considerado fixo e definido com base no estado atual e nas leis naturais que governam o universo. Na prática significa que se o throughput de uma API está aumentando, mais chamadas laterais podem acontecer, resultando em um alto consumo de banda e maior uso do banco de dados. Nesse sentido, é importante lembrar que se o sistema foi mal desenhado ou se seus subsistemas carregam débitos técnicos a observabilidade vai te ajudar a identificar esses problemas rapidamente.</p><p>⚠️ Quem avisa amigo é. Cuidado para não tratar apenas um problema que é reflexo de um problema maior. O efeito cascata é comum em arquiteturas complexas e encontrar a causa raiz costuma  ser difícil! Vamos seguido..</p><p>Normalmente o que consguimos ter dos sistemas são logs, traces, métricas e eventos. Existem várias ferramentas no mercado para lidar com isso tais como: Prometheus, Grafana, Elasticsearch, Logstash, Kibana, Splunk, New Relic, Datadog, Jaeger, Zipkin, Dynatrace, Honeycomb, AppDynamics, Sentry, Fluentd, Nagios, Zabbix, VictoriaMetrics, Thanos, OpenTelemetry e Graylog. Essa lista é apenas uma pequena amostra, pois há muitas outras ferramentas disponíveis. Quero destacar três das ferramentas supracitadas e fazer uma breve tangente: <strong>Dynatrace, New Relic e Datadog</strong>. Em todos os lugares em que trabalhei, pelo menos uma dessas três empresas estava presente. O mais intrigante é que todas elas enfrentaram o mesmo problema: <strong>custo em ascensão acelerado(custo por mês)</strong>. Contudo, meu objetivo aqui não é critica-las nem mesmo suas soluções de mercado, mas, em aprender com os seus modelos de negócios e no que eles implicam.</p><p>Essas empresas normalmente enfrentam três desafios principais. O primeiro está relacionado à própria observabilidade, ou seja, como extrair dados relevantes de sistemas complexos da forma mais abstrata possível para seus clientes. O segundo é como fornecer visualizações rápidas, elegantes e confiáveis, lembrando que cada cliente terá necessidades específicas. O terceiro desafio está relacionado ao modelo de negócio mencionado anteriormente e diz respeito a como essas empresas lidam com a <strong>grande quantidade de dados</strong> extraídos. A verdade é que crescer é um processo natural e, se você não tiver um bom planejamento, vai precisar de uma boa quantia de dinheiro. Seja porque sua volumetria aumentou, novos sistemas surgiram ou sua configuração de verbosidade não está das melhores. No final, esteja preparado para pagar o preço. Dentre as perguntas que você se propôs a responder até agora, aqui entra a primeira diretamente relacionada a uma grande decisão de um projeto de observabilidade: <strong>pagar mais caro e delegar ou tentar economizar abraçando a complexidade técnica?</strong> Eu não posso responder essa pergunta e você sabe muito bem disso.</p><p>Saindo do assunto dinheiro, um movimento que tenho percebido nos últimos anos é a atenção à observabilidade logo no início dos projetos, assim como aconteceu com segurança após décadas de perdas financeiras e vazamentos de dados. As pessoas sabem que precisam ter visibilidade de seus sistemas no dia um(bem como eles precisam estar seguros) e hoje grandes projetos de software (open source ou não) normalmente possuem bons logs e boas métricas(<em>/metrics</em>).</p><p>A pessoa responsável por buscar observabilidade geralmente começa pesquisando as opções disponíveis para a stack utilizada no projeto ou na empresa. Inicialmente, encontra soluções robustas, porém pagas. Em seguida, inevitavelmente descobre soluções maduras de mercado, como Prometheus, Grafana e OpenTelemetry. Normalmente, a escolha é feita rapidamente, mas existem muitas questões importantes que também devem ser respondidas. Se essas questões forem ignoradas, é apenas uma questão de tempo até que surjam problemas.</p><p>Definir padrões, fazer previsões de armazenamento, selecionar e manter ferramentas, estabelecer métricas relevantes, configurar rastreamento distribuído, compreender as dependências do sistema, lidar com sistemas assíncronos e diferentes tecnologias são apenas a ponta do iceberg dos desafios que estão por vir.</p><p>Vamos refletir. Talvez a parte <strong>core</strong> do seu sistema esteja funcionando normalmente, mas o serviço de autenticação esteja fora do ar. Seus usuários não conseguem fazer login. Isso é suficiente para colocar seu SLA em risco a cada minuto de indisponibilidade. Nesse caso, você deve esperar que algum alarme seja disparado. Caso contrário, dependerá da boa vontade de um engenheiro de confiabilidade abrir o dashboard ou, pior ainda, de uma onda de reclamações no seu canal de atendimento.</p><p>O cenário hipotético acima ressalta a importância fundamental de um engenheiro competente. As mentes hábeis selecionarão as ferramentas adequadas, que se assemelham a uma terra fértil para o plantio. Estas auxiliarão na geração, captura e armazenamento de dados sobre os sistemas. Posteriormente, o mesmo engenheiro hábil os correlacionará de modo a representarem aspectos significativos do negócio. A agregação desses dados, apresentada de forma simplificada, proporciona uma visão compreensível mesmo para aqueles que não compartilham da mesma visão holística. Em síntese, alguém pensará de antemão para que os subsequentes não precisem fazê-lo. Trata-se de um projeto de melhoria contínua que jamais se encerra. O reflexo disso é ter dados bons o suficiente para montar alarmes eficazes que vão ajudar a responder a incidentes de maneira rápida. Repita esse fluxo várias vezes, pois observabilidade está mais para um processo contínuo do que um estado final.</p>",
            "url": "/2024/07/12/sistemas-observaveis-parte-1.html",
            
            
            
            "tags": ["observabilidade","monitoramento"],
            
            "date_published": "2024-07-12T00:00:00+00:00",
            "date_modified": "2024-07-12T00:00:00+00:00",
            
                "author": 
                ""
                
            
        },
    
        {
            "id": "/2024/07/09/2024-07-08-tip-sre-interview.html",
            "title": null,
            "summary": null,
            "content_text": "",
            "content_html": "",
            "url": "/2024/07/09/2024-07-08-tip-sre-interview.html",
            
            
            
            
            
            "date_published": "2024-07-09T23:16:53+00:00",
            "date_modified": "2024-07-09T23:16:53+00:00",
            
                "author": 
                ""
                
            
        },
    
        {
            "id": "/2024/07/09/2024-07-08-tip-dicionario-do-sre.html",
            "title": null,
            "summary": null,
            "content_text": "            Termo      Definição                  API      Interface de Programação de Aplicações. Um conjunto de rotinas e padrões para utilização de funcionalidades por aplicativos externos.              A/B Testing      Teste A/B. Método estatístico para comparar duas versões de um aplicativo ou página web para determinar qual é mais eficaz.              Basic Authentication      Autenticação Básica. Método simples de autenticação HTTP usando usuário e senha codificados em base64.              Clean Code      Código Limpo. Princípios e práticas para escrever código legível, modular e de fácil manutenção.              Cookie      Pequeno arquivo enviado pelo servidor e armazenado localmente no navegador, usado para gerenciar sessões e autenticação.              CQRS      Command Query Responsibility Segregation. Padrão de design que separa a leitura e escrita de dados em diferentes modelos.              Dependency Injection      Injeção de Dependência. Padrão de design que permite passar dependências para um objeto em tempo de execução, melhorando a modularidade e testabilidade do código.              Docker      Plataforma para desenvolver, enviar e executar aplicativos em containers. Facilita o empacotamento de uma aplicação e suas dependências em um único objeto.              DRY      Don’t Repeat Yourself. Princípio de desenvolvimento para reduzir duplicação de código através de abstração e reutilização.              Event Sourcing      Padrão de arquitetura onde o estado de um sistema é determinado por uma sequência de eventos registrados, permitindo reconstruir o estado atual a partir do histórico de eventos.              GraphQL      Linguagem de consulta e runtime para APIs. Permite aos clientes definir a estrutura de dados que precisam, facilitando consultas eficientes e flexíveis.              Idempotency      Idempotência. Propriedade de operações que podem ser aplicadas múltiplas vezes sem alterar o resultado além da primeira aplicação.              JWT      JSON Web Token. Formato compacto para transmitir informações entre partes como um objeto JSON. Usado para autenticação em APIs.              Kubernetes      Sistema open-source para automatizar a implantação, o dimensionamento e a gestão de aplicativos em containers.              Microservices      Microserviços. Arquitetura de software que organiza uma aplicação como um conjunto de serviços independentes, cada um focado em uma tarefa específica.              ORM      Object-Relational Mapping. Técnica de programação que mapeia objetos de um sistema orientado a objetos para representações de dados relacionais.              Round Robin      Método de balanceamento de carga que distribui requisições igualmente entre os servidores disponíveis, sem considerar o estado anterior.              Session      Sessão. Manutenção de estado entre requisições de um usuário em uma aplicação web.              SOLID      Princípios de design de software que promovem um código mais limpo, flexível e fácil de manter: Single Responsibility, Open/Closed, Liskov Substitution, Interface Segregation e Dependency Inversion.              TDD      Test-Driven Development. Método de desenvolvimento de software onde testes automatizados são escritos antes do código de produção.              Token      Token. Pequeno pacote de dados que serve como um identificador único e seguro para autenticação e autorização.              URL      Uniform Resource Locator. Endereço que define o local de um recurso na web.              URI      Uniform Resource Identifier. Identificador único que define o local de um recurso na web.              WebSockets      Protocolo de comunicação bidirecional, full-duplex, entre um cliente e um servidor web, adequado para aplicações que requerem comunicação em tempo real.      ",
            "content_html": "<table>  <thead>    <tr>      <th>Termo</th>      <th>Definição</th>    </tr>  </thead>  <tbody>    <tr>      <td>API</td>      <td>Interface de Programação de Aplicações. Um conjunto de rotinas e padrões para utilização de funcionalidades por aplicativos externos.</td>    </tr>    <tr>      <td>A/B Testing</td>      <td>Teste A/B. Método estatístico para comparar duas versões de um aplicativo ou página web para determinar qual é mais eficaz.</td>    </tr>    <tr>      <td>Basic Authentication</td>      <td>Autenticação Básica. Método simples de autenticação HTTP usando usuário e senha codificados em base64.</td>    </tr>    <tr>      <td>Clean Code</td>      <td>Código Limpo. Princípios e práticas para escrever código legível, modular e de fácil manutenção.</td>    </tr>    <tr>      <td>Cookie</td>      <td>Pequeno arquivo enviado pelo servidor e armazenado localmente no navegador, usado para gerenciar sessões e autenticação.</td>    </tr>    <tr>      <td>CQRS</td>      <td>Command Query Responsibility Segregation. Padrão de design que separa a leitura e escrita de dados em diferentes modelos.</td>    </tr>    <tr>      <td>Dependency Injection</td>      <td>Injeção de Dependência. Padrão de design que permite passar dependências para um objeto em tempo de execução, melhorando a modularidade e testabilidade do código.</td>    </tr>    <tr>      <td>Docker</td>      <td>Plataforma para desenvolver, enviar e executar aplicativos em containers. Facilita o empacotamento de uma aplicação e suas dependências em um único objeto.</td>    </tr>    <tr>      <td>DRY</td>      <td>Don’t Repeat Yourself. Princípio de desenvolvimento para reduzir duplicação de código através de abstração e reutilização.</td>    </tr>    <tr>      <td>Event Sourcing</td>      <td>Padrão de arquitetura onde o estado de um sistema é determinado por uma sequência de eventos registrados, permitindo reconstruir o estado atual a partir do histórico de eventos.</td>    </tr>    <tr>      <td>GraphQL</td>      <td>Linguagem de consulta e runtime para APIs. Permite aos clientes definir a estrutura de dados que precisam, facilitando consultas eficientes e flexíveis.</td>    </tr>    <tr>      <td>Idempotency</td>      <td>Idempotência. Propriedade de operações que podem ser aplicadas múltiplas vezes sem alterar o resultado além da primeira aplicação.</td>    </tr>    <tr>      <td>JWT</td>      <td>JSON Web Token. Formato compacto para transmitir informações entre partes como um objeto JSON. Usado para autenticação em APIs.</td>    </tr>    <tr>      <td>Kubernetes</td>      <td>Sistema open-source para automatizar a implantação, o dimensionamento e a gestão de aplicativos em containers.</td>    </tr>    <tr>      <td>Microservices</td>      <td>Microserviços. Arquitetura de software que organiza uma aplicação como um conjunto de serviços independentes, cada um focado em uma tarefa específica.</td>    </tr>    <tr>      <td>ORM</td>      <td>Object-Relational Mapping. Técnica de programação que mapeia objetos de um sistema orientado a objetos para representações de dados relacionais.</td>    </tr>    <tr>      <td>Round Robin</td>      <td>Método de balanceamento de carga que distribui requisições igualmente entre os servidores disponíveis, sem considerar o estado anterior.</td>    </tr>    <tr>      <td>Session</td>      <td>Sessão. Manutenção de estado entre requisições de um usuário em uma aplicação web.</td>    </tr>    <tr>      <td>SOLID</td>      <td>Princípios de design de software que promovem um código mais limpo, flexível e fácil de manter: Single Responsibility, Open/Closed, Liskov Substitution, Interface Segregation e Dependency Inversion.</td>    </tr>    <tr>      <td>TDD</td>      <td>Test-Driven Development. Método de desenvolvimento de software onde testes automatizados são escritos antes do código de produção.</td>    </tr>    <tr>      <td>Token</td>      <td>Token. Pequeno pacote de dados que serve como um identificador único e seguro para autenticação e autorização.</td>    </tr>    <tr>      <td>URL</td>      <td>Uniform Resource Locator. Endereço que define o local de um recurso na web.</td>    </tr>    <tr>      <td>URI</td>      <td>Uniform Resource Identifier. Identificador único que define o local de um recurso na web.</td>    </tr>    <tr>      <td>WebSockets</td>      <td>Protocolo de comunicação bidirecional, full-duplex, entre um cliente e um servidor web, adequado para aplicações que requerem comunicação em tempo real.</td>    </tr>  </tbody></table>",
            "url": "/2024/07/09/2024-07-08-tip-dicionario-do-sre.html",
            
            
            
            
            
            "date_published": "2024-07-09T23:16:53+00:00",
            "date_modified": "2024-07-09T23:16:53+00:00",
            
                "author": 
                ""
                
            
        }
    
    ]
}